i = int(input())
my_list = []



while i > 0:
    my_list.append()
    print(i)
    i = i + 2

    ## dasdasd





# 4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.
